{
    "lux_levels": [
        {
            "range": "0-50",
            "description": "Very Low Light (Dimly lit room or heavily shaded area)",
            "suitable_plants": [
                "Snake Plant",
                "Pothos",
                "Cast Iron Plant"
            ],
            "tips": [
                "Rotate plants weekly to ensure even exposure to light and avoid uneven growth.",
                "Clean dust off leaves to maximize the light plants can absorb.",
                "Pair with artificial grow lights if plants appear to struggle with this level of light.",
                "Avoid overwatering, as plants in low light consume water slowly.",
                "Choose plants with dark green leaves, as they are more efficient in low-light conditions."
            ]
        },
        {
            "range": "50-200",
            "description": "Low Light (Typical in offices or rooms with small windows)",
            "suitable_plants": [
                "ZZ Plant",
                "Spider Plant",
                "Chinese Evergreen"
            ],
            "tips": [
                "Use mirrors or reflective surfaces to amplify available light.",
                "Place plants as close as possible to the light source, like windows or lamps.",
                "Avoid fertilizing excessively, as low-light plants grow more slowly.",
                "Monitor for signs of insufficient light, like yellowing leaves or stunted growth.",
                "Gradually introduce plants to higher light levels if their growth stagnates."
            ]
        },
        {
            "range": "200-500",
            "description": "Moderate Light (Well-lit indoor space with indirect sunlight)",
            "suitable_plants": [
                "Ferns",
                "Dracaena",
                "Philodendron"
            ],
            "tips": [
                "Keep plants a few feet away from windows to prevent exposure to harsh sunlight.",
                "Water moderately and ensure pots have proper drainage.",
                "Group plants together to create a microenvironment with consistent humidity.",
                "Prune dead leaves to encourage healthy new growth.",
                "Rotate pots to maintain balanced and symmetrical plant shapes."
            ]
        },
        {
            "range": "500-1000",
            "description": "Bright Indirect Light (Near a window with filtered sunlight or light curtains)",
            "suitable_plants": [
                "Monstera",
                "Fiddle Leaf Fig",
                "Orchids"
            ],
            "tips": [
                "Use sheer curtains to diffuse intense light if the window faces the sun directly.",
                "Fertilize every 1–2 months during the growing season to support active growth.",
                "Avoid placing plants against cold windows to prevent temperature shock.",
                "Check the soil more frequently, as bright light can dry it out faster.",
                "Create a schedule for rotating plants to promote even exposure to light."
            ]
        },
        {
            "range": "1000-10000",
            "description": "Full Sunlight (Outdoors in shaded or semi-shaded areas)",
            "suitable_plants": [
                "Herbs",
                "Succulents",
                "Citrus Trees"
            ],
            "tips": [
                "Water early in the morning to prevent water loss through evaporation.",
                "Mulch soil to retain moisture and reduce water needs.",
                "Acclimate plants to high light gradually to avoid scorching.",
                "Use planters with UV-resistant materials to prevent overheating roots.",
                "Inspect leaves regularly for signs of sunburn, like brown or bleached spots."
            ]
        },
        {
            "range": "10000-100000",
            "description": "Direct Sunlight (Outdoors in full sunlight, ideal for sun-loving plants)",
            "suitable_plants": [
                "Sunflowers",
                "Lavender",
                "Roses"
            ],
            "tips": [
                "Water deeply but less frequently to encourage strong root growth.",
                "Use companion plants or trellises to provide partial shade for young plants.",
                "Apply organic fertilizers to support vigorous growth in sunny conditions.",
                "Mist leaves occasionally to increase humidity if the air is very dry.",
                "Monitor pots for overheating and move them if necessary to cooler locations."
            ]
        }
    ]
}